Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: For a more in-depth look at how Git stores its data and how you can recover data that seems lost, see <<_undoing>>.
cs: Podrobnější informace o tom, jak Git ukládá data a jak lze obnovit zdánlivě ztracenou práci, najdete v podkapitole <<_undoing>>.

source: For a project with hundreds or thousands of commits, this can literally take hours or even days to finish.
cs: U projektů se stovkami nebo tisíci revizí si můžete bez nadsázky počkat i celé hodiny nebo dny.

source: For another example, if you stage the `CONTRIBUTING.md` file and then edit it, you can use `git diff` to see the changes in the file that are staged and the changes that are unstaged.
cs: Další příklad... Pokud jste soubor `CONTRIBUTING.md` připravili k zapsání a poté ho znovu upravili, můžete příkaz `git diff` použít k zobrazení změn v souboru, které byly připraveny k zapsání, a změn, které nejsou připraveny k zapsání.

source: For each reference that this push will update, the `send-pack` process tells the `receive-pack` process that information.
cs: Pro každou referenci, která bude tímto odesláním aktualizována, sdělí proces `send-pack` tuto informaci procesu `receive-pack`.

source: For example, a repository with multiple remotes for working with several collaborators might look something like this.
cs: Repozitář s více vzdálenými servery, který slouží pro spolupráci s více lidmi, může vypadat například takto.

source: For example, everyone knows to a certain degree what everyone else on the project is doing.
cs: Všichni například do určité míry vědí, co na projektu dělají ostatní účastníci.

source: For example, if you make two changes to your simplegit.rb file and want to stage one of them and not the other, doing so is very easy in Git.
cs: Pokud například provedete dvě změny v souboru simplegit.rb a chcete k zapsání připravit pouze jednu z nich, není to v systému Git žádný problém.

source: For example, if you want all but `cr-at-eol` to be set, you can do this:
cs: Chcete-li například zapnout všechny funkce kromě `cr-at-eol`, zadejte příkaz v tomto tvaru:

source: For example, if you want to change the last three commit messages, or any of the commit messages in that group, you supply as an argument to `git rebase -i` the parent of the last commit you want to edit, which is `HEAD~2^` or `HEAD~3`.
cs: Pokud chcete například změnit zprávy u posledních tří revizí nebo jakoukoli zprávu k revizi z této skupiny, přidejte jako parametr k příkazu `git rebase -i` rodiče poslední revize, kterou chcete upravovat, v tomto případě tedy `HEAD~2^` nebo `HEAD~3`.

source: For example, if you want to fetch all the information that Paul has but that you don't yet have in your repository, you can run `git fetch pb`:
cs: Pokud například chcete vyzvednout (fetch) všechny informace, které má Paul, ale vy je ještě nemáte ve svém repozitáři, můžete provést příkaz `git fetch pb`:

source: For example, if you want to see some abbreviated stats for each commit, you can use the `--stat` option:
cs: Pokud například chcete pro každou revizi zobrazit některé stručné statistiky, použijte volbu `--stat`:

source: For example, if you want to see which commits modifying test files in the Git source code history were committed by Junio Hamano and were not merged in the month of October 2008, you can run something like this:(((log filtering)))
cs: Pokud například chcete zjistit, které revize upravující testovací soubory ve zdrojovém kódu Gitu zapsal Junio Hamano v říjnu 2008 (relativně k časové zóně New Yorku) a které přitom nevznikly sloučením (merge), můžete zadat následující příkaz:(((log filtrování)))

source: For example, if you want to submit a second topic of work to the project, don't continue working on the topic branch you just pushed up – start over from the main repository's `master` branch:
cs: Pokud například chcete do projektu odeslat druhé pracovní téma, nepokračujte v práci v tématické větvi, kterou jste právě odeslali. Začněte znovu od začátku z větve `master` hlavního repozitáře:

source: For example, if you're on a system that has yum (such as Fedora) or apt-get (such as a Debian based system), you can use one of these commands to install the minimal dependencies for compiling and installing the Git binaries:
cs: Pokud používáte systém s nástrojem yum (jako je Fedora) nebo apt-get (například distribuce odvozené od Debianu), můžete k instalaci použít jeden z následujících příkazů, který nainstaluje minimální sadu knihoven, na kterých je Git závislý:

source: For example, if your contributor sends you two patches and you create a branch called `contrib` and applied those patches there, you can run this:
cs: Pokud vám například přispěvatel pošle dvě záplaty a vy vytvoříte větev s názvem `contrib`, do níž tyto záplaty aplikujete, můžete použít tento příkaz:

source: For example, in the history listed earlier, `HEAD~3` would be
cs: Například v historii naznačené výše by `HEAD~3` znamenalo

source: For example, let's say you've changed two files and want to commit them as two separate changes, but you accidentally type `git add *` and stage them both.
cs: Řekněme například, že jste změnili dva soubory a chcete je zapsat jako dvě oddělené změny, jenže omylem jste zadali příkaz `git add *` a oba soubory jste tím připravili k zapsání.

source: For example, say you run `git push origin master` in your project, and `origin` is defined as a URL that uses the SSH protocol.
cs: Řekněme například, že ve svém projektu spustíte příkaz `git push origin master` a `origin` je definován jako URL používající protokol SSH.

source: For example, suppose you want to split the middle commit of your three commits.
cs: Řekněme, že chcete rozdělit třeba prostřední ze svých tří revizí.

source: For example, this command gets the list of commits made in the last two weeks:
cs: Například následující příkaz zobrazí seznam všech revizí pořízených za poslední dva týdny (2 weeks):

source: For example, to browse the history of the project, Git doesn't need to go out to the server to get the history and display it for you – it simply reads it directly from your local database.
cs: Pokud například chcete procházet historii projektu, Git kvůli tomu nemusí vyhledávat informace na serveru -- načte je jednoduše přímo z vaší lokální databáze.

source: For example, to change your `extDiff` and `extMerge` tools to run the KDiff3 tool instead, all you have to do is edit your `extMerge` file:
cs: Chcete-li například změnit nástroje `extDiff` a `extMerge`, aby se místo nich spouštěl nástroj KDiff3, jediné, co musíte udělat, je upravit soubor `extMerge`:

source: For example, to clone a local repository, you can run something like this:
cs: Naklonování lokálního repozitáře můžete provést například spuštěním něčeho takového:

source: For example, to correct the usability problem you encountered with unstaging a file, you can add your own unstage alias to Git:
cs: Pokud jste například narazili na problém s používáním příkazu pro vrácení souboru z oblasti připravených změn, můžete ho vyřešit přidáním vlastního aliasu:

source: For example, to modify only the third commit message, you change the file to look like this:
cs: Chcete-li například změnit pouze zprávu ke třetí revizi, změňte soubor následovně:

source: For example, to see a specific commit, suppose you run a `git log` command and identify the commit where you added certain functionality:
cs: Pokud si chcete například prohlédnout konkrétní revizi, řekněme, že spustíte příkaz `git log` a určíte revizi, do níž jste vložili určitou funkci:

source: For example, to set the meta information in your diff output to blue foreground, black background, and bold text, you can run
cs: Budete-li chtít nastavit například meta informace ve výpisu příkazu diff tak, aby měly modré popředí, černé pozadí a tučné písmo, můžete použít příkaz:

source: For example, you can do some simple version control on a file.
cs: Na souboru můžete například provádět jednoduché verzování.

source: For example, you can get the manpage help for the config command by running(((git commands, help)))
cs: Například nápovědu pro příkaz `config` vyvoláte zadáním(((git příkazy, nápověda)))

source: For example, you can start a branch named `recover-branch` at that commit (ab1afef):
cs: Na revizi můžete vytvořit například větev `recover-branch` (ab1afef):

source: For instance, if Jessica wants to send John a pull request, and she's done two commits on the topic branch she just pushed up, she can run this:
cs: Pokud chce například Jessica poslat Johnovi požadavek na stažení a vytvořila předtím dvě revize v tématické větvi, kterou právě odeslala, může zadat tento příkaz:

source: For instance, if a documentation author tries to push a commit modifying something in the `lib` directory, they see
cs: Pokud se například autor dokumentace pokusí odeslat revizi, která mění obsah adresáře `lib`, zobrazí se mu upozornění:

source: For instance, if you want to see all commits that are reachable from `refA` or `refB` but not from `refC`, you can type one of these:
cs: Pokud chcete zobrazit například všechny revize, které jsou dostupné ve větvi `refA` nebo `refB`, ale nikoli ve větvi `refC`, zadejte jeden z následujících příkazů:

source: For instance, if you want to show the last commit object on a branch, the following commands are equivalent, assuming that the `topic1` branch points to `ca82a6d`:
cs: Pokud chcete například zobrazit objekt poslední revize větve, můžete využít některý z následujících příkazů (za předpokladu, že větev `topic1` ukazuje na `ca82a6d`):

source: For instance, if you wanted to find the last commit that added or removed a reference to a specific function, you could call:
cs: Pokud například chcete zjistit poslední revizi, kdy byl přidán nebo odstraněn odkaz na určitou funkci, můžete zavolat:

source: For instance, if you wanted to see what the `master` branch on your `origin` remote looked like as of the last time you communicated with it, you would check the `origin/master` branch.
cs: Pokud například chcete zjistit, jak vypadala větev `master` ve vašem vzdáleném repozitáři `origin`, když jste s ní naposledy komunikovali, budete hledat větev `origin/master`.

source: For instance, in the previous scenario, if instead of doing a merge when we're at <<_pre_merge_rebase_work>> we run `git rebase teamone/master`, Git will:
cs: Tak například, pokud se při předchozím scénáři nacházíme v situaci na obrázku <<_pre_merge_rebase_work>> a místo provedení sloučení (merge) spustíme `git rebase teamone/master`, provede Git následující:

source: For instance, the Linux kernel recently jumped from 8 to 10 characters to ensure SHA-1 object uniqueness, so older `git describe` output names were invalidated.
cs: Například jádro Linuxu nyní přešlo z 8 na 10 znaků, aby byla zajištěna jedinečnost objektů SHA-1. Starší výstupy příkazu `git describe` proto už nebudou platné.

source: For instance, to see where your `master` branch was yesterday, you can type
cs: Chcete-li například zjistit, kde byla vaše větev `master` včera (yesterday), můžete zadat příkaz:

source: For instance, you can add a remote called `origin` and push your `master` branch to it:
cs: Můžete například přidat vzdálený repozitář `origin` a odeslat do něj větev `master`:

source: For instance, you might resolve this conflict by replacing the entire block with this:
cs: Tento konflikt můžete vyřešit například nahrazením celého bloku tímto textem:

source: For larger companies or projects, the number of developers could be in the thousands, with hundreds or thousands of commits coming in each day.
cs: U větších společností nebo u větších projektů může počet vývojářů dosahovat tisíců -- při stovkách nebo tisících zápisů revizí (commit) denně.

source: For more information on the various credential caching options available, see <<_credential_caching>>.
cs: Více informací o různých volbách pro uchovávání pověřovacích dat naleznete v podkapitole <<_credential_caching>>.

source: For more options, there are instructions for installing on several different Unix flavors on the Git website, at http://git-scm.com/download/linux[].
cs: Další možnosti naleznete v instrukcích pro instalaci na několika různých odrůdách Unixu. Nacházejí se na webovém serveru Gitu, na stránce http://git-scm.com/download/linux[].

source: For now this magic invocation is all you need to know about the `git reset` command.
cs: Prozatím je tato magická formule vše, co o příkazu `git reset` potřebujete vědět.

source: For now, let's assume you've committed all your changes, so you can switch back to your `master` branch:
cs: Teď předpokládejme, že jste všechny změny zapsali, takže se můžete přepnout zpět do větve `master`:

source: For now, that branch is always ``master'', which is the default; you won't worry about it here.
cs: Prozatím budeme uvažovat, že jde o větev `master`, což je výchozí název (zatím se s tím nezatěžujte).

source: For now, we can see from the output that there is a single commit that John has made that Jessica has not merged in.
cs: Z výstupu vidíme, že existuje jediná revize, kterou zapsal John a kterou Jessica nesloučila se svou prací.

source: For one thing, you should clean up the weird references that `git svn` set up.
cs: Zaprvé je nutné vyčistit podivné reference, které vytvořil příkaz `git svn`.

source: For one, the command line is the only place you can run *all* Git commands – most of the GUIs only implement some subset of Git functionality for simplicity.
cs: Především, příkazový řádek je jediným místem, kde můžete spustit *všechny* příkazy Gitu. Většina grafických uživatelských rozhraní pro jednoduchost implementuje jen podmnožinu funkčnosti Gitu.

source: For the examples in this book you will use software source code as the files being version controlled, though in reality you can do this with nearly any type of file on a computer.
cs: V této knize jsou jako příklady souborů použity zdrojové texty programů, avšak ve skutečnosti lze správu verzí použít pro libovolný typ souborů.

source: For this book, we will be using Git on the command line.
cs: V této knize budeme Git používat z příkazového řádku.

source: From that point forward, it should be called.
cs: Od tohoto okamžiku by měl být skript volán.

source: From the interactive prompt, type `5` or `p` (for patch).
cs: Na interaktivní výzvu zadejte příkaz `5` nebo `p` (jako „patch“ – tedy záplata).

source: From this angle, changing the commit history is almost blasphemous; you're _lying_ about what actually transpired.
cs: Z tohoto pohledu jsou úpravy historie zápisů revizí téměř rouhačstvím; _lžete_ o tom, co se skutečně stalo.

source: Further paragraphs come after blank lines.
cs: Další odstavce se oddělují prázdným řádkem.

source: Furthermore, if you push this history back up to the server, you'll reintroduce all those rebased commits to the central server, which can further confuse people.
cs: Když navíc odešlete takovou historii zpět na server, znovu na centrálním serveru vzniknou všechny objekty revizí, které vznikly přeskládáním, což vede k dalšímu zmatení lidí okolo.

source: Furthermore, many of these systems deal pretty well with having several remote repositories they can work with, so you can collaborate with different groups of people in different ways simultaneously within the same project.
cs: Mnoho z těchto systémů navíc bez větších obtíží pracuje i s několika vzdálenými repozitáři, takže můžete v rámci jednoho projektu různým způsobem spolupracovat s různými skupinami lidí najednou.

source: Furthermore, what overall workflow do you want to use to maintain your project?
cs: A vůbec, jaký celkový pracovní postup zvolíte ke správě projektu?

source: Furthermore, you want your collaborators to be able to access the repository even if your computer is offline – having a more reliable common repository is often useful.
cs: Navíc chcete, aby měli vaši spolupracovníci do repozitáře přístup, i když je váš počítač vypnutý nebo odpojený. Často bývá spolehlivější, když existuje společný repozitář.

source: Generally it's better to simply use the `fetch` and `merge` commands explicitly as the magic of `git pull` can often be confusing.
cs: Obecně bývá lepší přímo použít příkazy `fetch` a `merge`, protože magie skrytá za `git pull` může být často matoucí.

source: Generally, eight to ten characters are more than enough to be unique within a project.
cs: Osm až deset znaků většinou bohatě stačí, aby byla hodnota v rámci projektu jednoznačná.

source: Generally, this happens because you force-delete a branch that had work on it, and it turns out you wanted the branch after all; or you hard-reset a branch, thus abandoning commits that you wanted something from.
cs: Většinou k tomu dochází tak, že násilím smažete větev, která uchovávala část vaší práce, a vy po čase zjistíte, že byste tuto větev přece jen potřebovali. Stejně tak jste mohli provést tvrdý reset větve a tím zavrhnout revize, z nichž nyní něco potřebujete.

source: Generally, this script is used for notification or something similar.
cs: Tento skript se tak většinou používá pro účely oznámení a podobně.

source: Generally, you’ll type `y` or `n` if you want to stage each hunk, but staging all of them in certain files or skipping a hunk decision until later can be helpful too.
cs: Chcete-li připravit k zapsání jednotlivé komplexy, většinou zadáte `y` nebo `n`. Přesto se vám může někdy hodit i možnost připravit všechny komplexy v určitých souborech nebo přeskočení komplexu, k němuž se vrátíte později.

source: Getting in the habit of creating quality commit messages makes using and collaborating with Git a lot easier.
cs: Pokud si zvyknete připisovat k revizím kvalitní zprávy, bude pro vás práce s Gitem a spolupráce s ostatními mnohem jednodušší.

source: Git aborts the patch if this script exits non-zero.
cs: Je-li výstup tohoto skriptu nenulový, Git přeruší záplatu.

source: Git addresses this issue using submodules.
cs: Git nabízí jako řešení tohoto problému nástroj submodulů.

source: Git adds standard conflict-resolution markers to the files that have conflicts, so you can open them manually and resolve those conflicts.
cs: Git přidává do souborů způsobujících konflikt standardní značky pro označení konfliktů (conflict-resolution markers), takže soubory můžete ručně otevřít a konflikty vyřešit.

source: Git allows you to do this by using either the `^` character or `--not` before any reference from which you don’t want to see reachable commits.
cs: V systému Git to můžete provést buď zadáním znaku `^` nebo parametru `--not` před referencí, jejíž dostupné revize si nepřejete zobrazit.

source: Git allows you to specify specific commits or a range of commits in several ways.
cs: Systém Git umožňuje určit jednotlivé revize nebo interval revizí několika způsoby.

source: Git also doesn't see any untracked files, or they would be listed here.
cs: Git také neví o žádných nesledovaných souborech, jinak by byly ve výčtu uvedeny.

source: Git also gives you your own local `master` branch starting at the same place as origin's `master` branch, so you have something to work from.
cs: Git rovněž vytvoří vaši vlastní lokální větev `master`, která bude začínat ve stejném místě jako větev `master` serveru `origin`. Takže máte výchozí bod pro svou práci.

source: Git also has a short status flag so you can see your changes in a more compact way.
cs: Git nabízí použití příznaku pro zkrácený výpis stavu, který způsobí zobrazení změn v zhuštěné podobě.

source: Git also provides a couple of tools to help you debug issues in your projects.
cs: Git také nabízí několik nástrojů, které vám pomohou ladit problémy v projektech.

source: Git applies the last commit (`a5f4a0d`) in the script, and your history looks like this:
cs: Git aplikuje poslední revizi (`a5f4a0d`) ve skriptu. Vaše historie bude vypadat takto:

source: Git as a content-addressable filesystem is a very powerful tool that you can easily use as more than just a VCS.
cs: Git jakožto obsahově adresovatelný systém souborů je velmi výkonným nástrojem, který snadno využijete i k jiným účelům než jako pouhý systém VCS.

source: Git attributes offers you two ways to do this.
cs: Atributy Git nabízejí dvě možnosti, jak to provést.

source: Git automatically expands the `serverfix` branchname out to `refs/heads/serverfix:refs/heads/serverfix`, which means, ``Take my serverfix local branch and push it to update the remote's serverfix branch.'' We'll go over the `refs/heads/` part in detail in <<_git_internals>>, but you can generally leave it off.
cs: Git automaticky rozšíří název větve `serverfix` na `refs/heads/serverfix:refs/heads/serverfix`, což znamená: „Vezmi mou lokální větev `serverfix` a odešli ji do vzdáleného repozitáře, kde aktualizuje tamní větev `serverfix`.“ Částí `refs/heads/` se budeme podrobněji věnovat v kapitole <<_git_internals>>, ale nemusí být pro vás zajímavá.

source: Git can figure out a short, unique abbreviation for your SHA-1 values.
cs: Git dokáže identifikovat krátkou, jednoznačnou zkratku hodnoty SHA-1.

source: Git can use four major protocols to transfer data: Local, HTTP, Secure Shell (SSH) and Git.
cs: Git může k přenosu dat používat čtyři hlavní protokoly: lokální, HTTP, Secure Shell (SSH) a Git.

source: Git checks for any listed alternates first:
cs: Git nejprve zjistí, zda jsou k dispozici alternativní repozitáře:

source: Git checks out a working copy of the `master` branch that was pointed to by the HEAD reference you downloaded at the beginning.
cs: Git provede checkout pracovní kopie větve `master`, na niž ukazovala reference HEAD, kterou jste stáhli na začátku.

source: Git comes preset to detect and fix some whitespace issues.
cs: Git je standardně nastaven na vyhledávání a opravu chyb způsobených prázdnými znaky.

source: Git comes preset to use a number of other merge-resolution tools without your having to set up the cmd configuration.
cs: Git je standardně přednastaven tak, aby dokázal používat celou řadu různých nástrojů k řešení konfliktů při slučování, aniž byste museli nastavovat konfiguraci příkazu.

source: Git comes with a couple of scripts that make some command-line tasks easier.
cs: Git nabízí také celou řadu skriptů, které vám mohou usnadnit provádění příkazů zadávaných v příkazovém řádku.

source: Git comes with a tool called `git config` that lets you get and set configuration variables that control all aspects of how Git looks and operates.(((git commands, config))) These variables can be stored in three different places:
cs: Součástí Gitu je nástroj zvaný `git config`, který vám umožní nastavit konfigurační proměnné ovlivňující všechny stránky toho, jak Git vypadá a jak pracuje.(((git příkazy, config))) Tyto proměnné mohou být uloženy na třech různých místech:

source: Git compresses the new content with zlib, which you can do in Ruby with the zlib library.
cs: Git zkomprimuje nový obsah metodou zlib, která je obsažena v knihovně zlib.

source: Git concatenates the header and the original content and then calculates the SHA-1 checksum of that new content.
cs: Git vytvoří řetězec ze záhlaví a původního obsahu a vypočítá kontrolní součet SHA-1 tohoto nového obsahu.

source: Git constructs a header that starts with the type of the object, in this case a blob.
cs: Git vytvoří záhlaví, které bude začínat typem objektu, jímž je v našem případě blob.

source: Git does this if you have too many loose objects around, if you run the `git gc` command manually, or if you push to a remote server.
cs: Git k tomuto kroku přistoupí, pokud máte příliš mnoho volných objektů, pokud ručně spustíte příkaz `git gc` nebo jestliže odesíláte revize na vzdálený server.

source: Git doesn't automatically infer your command if you type it in partially.
cs: Jestliže zadáte neúplný příkaz, Git si ho automaticky nedoplní.
